{
  "approach_data": [
    {
      "icon": "Compass",
      "title": "INSIGHTS",
      "subtitle": "Discovery",
      "description": "Research-driven understanding of users, goals, and pain points to define a clear UX direction."
    },
    {
      "icon": "Layers",
      "title": "CREATION",
      "subtitle": "Design",
      "description": "Crafting intuitive layouts, interfaces, and interactions supported by strong visual and UX principles."
    },
    {
      "icon": "Monitor",
      "title": "REFINEMENT",
      "subtitle": "Validation",
      "description": "Testing prototypes, gathering feedback, and iterating to ensure the experience works flawlessly."
    },
    {
      "icon": "BarChart3",
      "title": "IMPLEMENTATION",
      "subtitle": "Delivery",
      "description": "Preparing polished, development-ready designs and systems for a smooth handoff and scalable growth."
    }
  ],
  "projects": [
    {
      "challenge": "In the age of information overload, users are bombarded with cluttered feeds, clickbait headlines, and complex jargon. For the South Asian market specifically, finding a platform that seamlessly switches between local (Bengali) and international (English) content while offering a simplified, hands-free experience was non-existent.",
      "client": "Fringecore",
      "gallery": [
        "https://cdn.dribbble.com/userupload/44756234/file/6ecb618c946f730ca84e33bbc323ed3a.png?resize=1024x768&vertical=center"
      ],
      "role": "Lead Product Designer",
      "title": "LilyGPT",
      "solution": "We crafted LilyGPT as a dual-language, voice-first news assistant. The interface features a sleek 'Dark Mode' aesthetic to reduce eye strain. We designed a robust 'Interest Selector' (visualized in the gallery) allowing users to filter topics like Politics, Sports, and Religion. The core innovation is the 'Listening Mode', visualizing the AI's active state with a glowing orb, making news accessibility seamless for users on the go.",
      "website": "https://www.lilygpt.com",
      "id": 1,
      "image": "https://cdn.dribbble.com/userupload/44756233/file/e314ea14265f6d8259843b3debd10ce8.png?resize=1024x768&vertical=center",
      "description": "Meet Lily GPT, your personal AI news anchor. Lily sifts through endless headlines and complex articles to deliver concise, easy-to-understand news briefings tailored just for you.",
      "year": "2024",
      "category": "Product Design"
    },
    {
      "challenge": "Industrial clients struggled to make sense of the massive amounts of sensor data related to carbon emissions. The existing tools were clunky and required data scientist level knowledge to operate.",
      "client": "GreenTech Solutions",
      "gallery": [
        "https://picsum.photos/seed/eco1/1200/800",
        "https://picsum.photos/seed/eco2/1200/800",
        "https://picsum.photos/seed/eco3/1200/800"
      ],
      "role": "UX Researcher & UI Designer",
      "title": "EcoStream SaaS",
      "solution": "We created 'EcoStream', a dashboard that synthesizes complex data into actionable insights. Using a modular card system and predictive analytics visualization, facility managers can now identify leaks and inefficiencies in real-time.",
      "id": 2,
      "image": "https://picsum.photos/seed/eco/800/1000",
      "description": "A comprehensive dashboard for monitoring environmental impact and carbon footprints.",
      "year": "2023",
      "category": "User Experience"
    },
    {
      "challenge": "Healthcare apps often feel sterile and clinical, causing anxiety for patients. Lumina needed a brand identity that conveyed trust, warmth, and professional competence.",
      "client": "Lumina",
      "gallery": [
        "https://picsum.photos/seed/lumina1/1200/800",
        "https://picsum.photos/seed/lumina2/1200/800",
        "https://picsum.photos/seed/lumina3/1200/800"
      ],
      "role": "Brand Strategist",
      "title": "Lumina Health",
      "solution": "We developed a soft, gradients-based visual language paired with a rounded sans-serif typography to create a sense of calm. The logo symbol combines a cross (health) with a spark (hope), representing the brand's mission to illuminate the path to recovery.",
      "id": 3,
      "image": "https://picsum.photos/seed/health/800/1000",
      "description": "Connecting patients with specialists through an intuitive and calming interface.",
      "year": "2023",
      "category": "Brand Identity"
    }
  ],
  "services": [
    {
      "id": "s1",
      "number": "01",
      "title": "Product Design",
      "description": "End-to-end digital product design from concept to high-fidelity prototypes. We focus on creating intuitive interfaces that solve real user problems while looking stunning.",
      "tags": [
        "UI Design",
        "Prototyping",
        "Design Systems"
      ]
    },
    {
      "id": "s2",
      "number": "02",
      "title": "Brand Identity",
      "description": "Crafting distinct visual languages that tell your story. From logo design to comprehensive brand guidelines, we ensure your brand stands out in a crowded market.",
      "tags": [
        "Logo Design",
        "Visual Language",
        "Guidelines"
      ]
    },
    {
      "id": "s3",
      "number": "03",
      "title": "Motion Graphics",
      "description": "Adding dimension to your digital presence. We create smooth micro-interactions and compelling narrative animations that guide users and delight the senses.",
      "tags": [
        "Interaction Design",
        "Lottie",
        "After Effects"
      ]
    },
    {
      "id": "s4",
      "number": "04",
      "title": "User Experience",
      "description": "Research-backed design decisions. We map out user journeys, conduct usability testing, and optimize flows to ensure friction-less experiences.",
      "tags": [
        "User Research",
        "Wireframing",
        "Usability Testing"
      ]
    }
  ],
  "skill_tags": [
    {
      "name": "SaaS",
      "icon": "Cloud"
    },
    {
      "name": "eCommerce",
      "icon": "Smartphone"
    },
    {
      "name": "AI Solutions",
      "icon": "Cpu"
    },
    {
      "name": "Cybersecurity",
      "icon": "Lock"
    }
  ],
  "resume_url": "/images/uploads/shakibulalamemonresume.pdf",
  "work_history": [
    {
      "company": "Fringecore",
      "role": "Product Manager",
      "period": "2022-PRESENT",
      "description": "Lead product vision, creative direction, and cross-functional collaboration across multiple enterprise and SaaS platforms.\nDesigned end-to-end UI/UX for ChainLink, an ERP system used to streamline organizational workflows and operational transparency.\nDefined product strategy and UX architecture for Product Sense, an AI-powered retail audit and brand performance intelligence platform.\nManaged roadmap and experience optimization for a Hospital Management System, improving clinical workflow efficiency and user accessibility.\nDesigned the digital news portal for Ekhon TV, enhancing content discoverability and engagement across web and mobile.\nCreated UI/UX for an LPG factory management and logistics platform, enabling real-time order processing, refill scheduling, delivery coordination,\nand tanker inventory control."
    }
  ]
}
